[
    {
      "_id": "623853b2614ad5aba311fdd1",
      "rating": 3,
      "comment": "I just got the watch, set it up and adjusted the links. So far so good. It looks like a very nice watch for the money. I thought about getting a Citizen, but they're so commonplace. It's kind of like vanilla ice cream. I wanted something with a little more pizzazz. ",
      "picture": "https://i.pinimg.com/originals/9f/3d/13/9f3d13912d3cf78e4c87975bcebc1fee.jpg",
      "name": "Richard Legere"
    },
    {
      "_id": "623853b2578e9e6ad1ae0dd5",
      "rating": 5,
      "comment": "Blown away! Awesome! My only problem was the color. I loved them all but went with the blue (my favorite). I will be buying the black and the white one now, ASAP. Absolutely 100% freaking beautiful!!",
      "picture": "https://render.fineartamerica.com/images/rendered/default/t-shirt/23/30/images/artworkimages/medium/1/coffee-coding-syntax-aadil-farooq-transparent.png?targetx=0&targety=0&imagewidth=430&imageheight=516&modelwidth=430&modelheight=575",
      "name": "Robert R. Lapierre"
    },
    {
      "_id": "623853b21fb149d2ee7b76c7",
      "rating": 4,
      "comment": "It's a nice looking watch. But when trying to resize it the one little tool broke. But it had an extra one. It almost broke so I have up and will now have to pay a jeweler to size it for me.",
      "picture": "https://images.unsplash.com/photo-1583743814966-8936f5b7be1a?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8NXx8dCUyMHNoaXJ0fGVufDB8fDB8fA%3D%3D&auto=format&fit=crop&w=500&q=60",
      "name": "Robert Watson"
    },
    {
      "_id": "623853b2e91c8de578c9245e",
      "rating": 3,
      "comment": "This feels like a pretty cheap watch material-wise, especially for the price tag. I really like the look and color, it just straight up feels cheap to me. I wanted to like this watch, but I couldn't bring myself to do that.",
      "picture": "https://5.imimg.com/data5/SH/GC/MY-8764775/mens-t-shirt-500x500.jpg",
      "name": "Brian F. Chadderton"
    },
    {
      "_id": "623853b2239582e48409ccc6",
      "rating": 3,
      "comment": "Immediately upon opening the box, the quality and care put into this timepiece was evident.  The watch has a slightly larger face than anticipated, and that is appreciated, since it sets this watch apart from some of the other brands that I own. The watch operates with perfectly smooth precision.  Most importantly, the design is extremely eye-catching.",
      "picture": "https://www.billbazar.com.bd/public/uploads/all/8hgD0lQGODVXbB5sokhvwr7mUNjBx7pEHusuyGZj.webp",
      "name": "Steve Smith"
    },
    {
      "_id": "623853b2cdda0d5bc294f791",
      "rating": 4,
      "comment": "Like a lot of people I've haven't worn wrist watches for ages, but this year I wanted to add some more maturity to my wardrobe and decided to get back to wearing watches, and everything I've seen from Hugo Boss so far has really impressed me.",
      "picture": "https://m.media-amazon.com/images/I/61GMJ+3ekAS._AC_UL320_.jpg",
      "name": "Lendi Simons"
    },
    {
      "_id": "623853b2736f19fd4eb8d44a",
      "rating": 5,
      "comment": "Though this watch has a nice look to it. . . If you need to see the date. If you are like me. You will be lost. The three “other” hands on the face could have been left-out. More for “show” than anything else. .Though. .some might find them helpful. It kind of makes this watch look a bit like a chronograph. .but it is not.",
      "picture": "https://i.pinimg.com/236x/af/96/95/af9695e0116a1d859336024e6cdcea10.jpg",
      "name": "Sam Curron"
    }
  ]